app/controllers/api/v1/messages_controller.rb

  def show
    message = Message.where(:id => params[:id]).first
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1

  def create
    body = JSON.parse(params[:body])
    message = Message.new(:content => body["content"],
                          :room_id => body["room_id"],
                          :author_id => body["author_id"],
                          :provider => body["provider"],
                          :branch => body["branch"] )

    if message.save
---
INSERT INTO "messages" ("actual_created_at", "author_id", "branch", "content", "created_at", "foo_text", "provider", "room_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)