app/controllers/messages_controller.rb

  def index
    @messages = Message.search(params)
---
SELECT "messages".* FROM "messages" LIMIT 1

  def create
    @message = Message.new(params[:message])
    if @message.save
---
INSERT INTO "messages" ("actual_created_at", "author_id", "branch", "content", "created_at", "foo_text", "provider", "room_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)